tbobd/certification2/test7/HotelSearchRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" >
    <hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
    </hot:Credentials>
    <wsa:Action>http://TekTravel/HotelBookingApi/HotelSearch</wsa:Action>
    <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelSearchRequest>
        <hot:CheckInDate>2020-12-27</hot:CheckInDate>
        <hot:CheckOutDate>2020-12-29</hot:CheckOutDate>
        <hot:CountryName>United Arab Emirates</hot:CountryName>
        <hot:CityName>Dubai</hot:CityName>
        <hot:CityId>115936</hot:CityId>
        <hot:IsNearBySearchAllowed>false</hot:IsNearBySearchAllowed>
        <hot:NoOfRooms>1</hot:NoOfRooms>
        <hot:GuestNationality>AE</hot:GuestNationality>
        <hot:IsRoomInfoRequired>true</hot:IsRoomInfoRequired>
        <hot:RoomGuests>
            <hot:RoomGuest AdultCount="1" ChildCount="0"/>
        </hot:RoomGuests>
        <hot:ResultCount>0</hot:ResultCount>
        <hot:Filters>
        <hot:HotelCodeList>1508526</hot:HotelCodeList>
        <hot:StarRating>All</hot:StarRating>
        <hot:OrderBy>PriceAsc</hot:OrderBy>
        </hot:Filters>
        <hot:ResponseTime>23</hot:ResponseTime>
    </hot:HotelSearchRequest>
</soap:Body>
</soap:Envelope>